package com.javarush.test.level03.lesson04.task01;

/* Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012
*/

public class Solution
{
    public static void main(String[] args)
    {
        int d = 13;
        int y  =1990;
        System.out.println("AUGUST" + " " + d + " " + y);
        //напишите тут ваш код
    }
}